text/12-higher-order-recursion.org
#+title: Chapter 12 : Higher Order Recursion

* <<introduction>>

In this chapter we continue the study of higher order recursion, with emphasis on third and fourth order recursion. The style of this chapter resembles that of Chapter 8 in that toy programs are used to illustrate techniques. There are two programs which use third order recursion to do without internal code what normally is done with internal code.

* Third order recursion

In the literature there are hardly any examples of procedures which take as parameters procedures which in turn take procedures as parameters. I only know of one example, due to Steengaard-Masden (1981), in which he uses such a technique for information hiding. The program below is adapted from his paper (p 1334); its sole output is the sequence of numbers =33 22 11\equal1= from procedure =demo=. The point of using the method at all is to hide the variables =s= and =ptr=, the stack and its top of stack pointer, in procedure =stack-implementation=, so that they cannot be inadvertently corrupted by =main= or by =demo=. Observe that procedure =demo= uses readable names for the stack operations =new=, =empty=, =push=, =pop= and =top=. Observe also that the corresponding local procedures inside the stack implementation procedure have cryptic names, and that the parameter procedures to the formal parameter of the stack implementation procedure are even more cryptic. This is intentional --- the user of the stack implementation procedure need not know the names of its parameters or its local variables and procedures.

#+begin_src pascal
PROGRAM stackmodule(output);

  PROCEDURE stack_implementation
        (PROCEDURE cp
                  (PROCEDURE n;
                   FUNCTION e : boolean;
                   PROCEDURE p1(n : integer);
                   PROCEDURE p2;
                   FUNCTION t : integer));

VAR s : ARRAY[0..20] OF integer; ptr : integer;

    PROCEDURE nw; BEGIN ptr := 0 END;
    FUNCTION em : boolean; BEGIN em := ptr = 0 END;
    PROCEDURE psh(n : integer); BEGIN ptr := ptr + 1; s[ptr] := n END;
    PROCEDURE pp; BEGIN ptr := ptr - 1 END;
    FUNCTION tp : integer; BEGIN tp := s[ptr] END;

BEGIN (* stack_implementation *)
  cp(nw,em,psh,pp,tp)
END; (* stack_implementation *)

PROCEDURE demo(PROCEDURE new;
               FUNCTION empty : boolean;
               PROCEDURE push(n : integer);
               PROCEDURE pop;
               FUNCTION top : integer);

BEGIN (* demo *)
  new; push(11); push(22); push(33);
WHILE NOT empty DO
    BEGIN write(top); pop END
END; (* demo *)

BEGIN (* main *)
stack_implementation(demo)
END. (* main *)
#+end_src
<P>
But note that there is no recursion in this program;
in what follows we shall only be concerned with
third order procedures which are recursive
in an interesting way.
** An example of third order recursion
<P>
The following program again reads lines of what will be
digit characters.
For each line
that it has read it will write on one line six lots of characters:
the digits forward,
their uppercase letter counterpart backward,
the lowercase letter counterpart forward,
the lowercase letter counterpart backward,
the uppercase letter counterpart forward,
the digits backward.
Between any two lots of characters there is a separating space.
Note again that as for several programs in Chapter 8
there is no explicit array and there are no linked structures
to save the input line.
Every character of the input line
is saved in the single local variable =ch=
on the run time stack.
Since there are six lots of printing characters,
there are five occurrences of the separating space.
In the program, these five occurrences have been commented
with =(* 1 *)= = .. = =(* 5 *)=.
The forward and backward sequencing of characters is also commented.
#+begin_src pascal
PROGRAM third_order_recursion(input,output);

PROCEDURE spacing;
BEGIN write('    ') END;

PROCEDURE spacedcall(PROCEDURE c);
BEGIN
spacing;                (* 2 *)
c;
spacing                 (* 4 *)
END; (* spacedcall *)

PROCEDURE recurse(PROCEDURE cp(PROCEDURE c); PROCEDURE ccp);
VAR ch : char;

    PROCEDURE local(PROCEDURE c);

        PROCEDURE locallocal;
        BEGIN                                    (* lower case *)
        write(chr(ord(ch) + ord('a') - ord('0'))); (* forward  *)
        c;      (* when c = spacing, 3 *)
        write(chr(ord(ch) + ord('a') - ord('0')))  (* backward *)
        END; (* locallocal *)

    BEGIN (* local *)                        (* upper case *)
    write(chr(ord(ch) + ord('A') - ord('0'))); (* backward *)
    cp(locallocal);
    write(chr(ord(ch) + ord('A') - ord('0')))  (* forward  *)
    END; (* local *)

BEGIN (* recurse *)
IF eoln THEN
    BEGIN
    ccp;                        (* 1 *)
    cp(ccp);
    ccp                         (* 5 *)
    END
  ELSE
    BEGIN                       (* digit    *)
    read(ch);
    write(ch);                  (* forward  *)
    recurse(local,ccp);
    write(ch)                   (* backward *)
    END
END; (* recurse *)

BEGIN (* main *)
WHILE NOT eof DO
    BEGIN recurse(spacedcall,spacing); writeln; readln END
END. (* main *)
#+end_src
<P>
Again note that there is only one variable,
local to procedure =recurse=.
It is accessed directly in procedure =recurse=
for reading and writing the digits,
it is accessed indirectly by one step through the static chain
or its equivalent in procedure =local=
for writing the upper case letters,
and it is accessed indirectly by two steps through the static chain
or its equivalent in procedure =locallocal=
for writing the lower case letters.
The program is only useful as a skeleton for studying access
into the recursion stack.
