12-higher-order-recursion.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 12 : Higher order recursion</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 12 : Higher order recursion"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:38:00 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 12 : Higher order recursion</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 Third order recursion</a>
<ul>
<li><a href="#sec-2-1">2.1 An example of third order recursion</a></li>
<li><a href="#sec-2-2">2.2 Partitioning numbers again</a></li>
<li><a href="#sec-2-3">2.3 Infix to prefix translation</a></li>
</ul>
</li>
<li><a href="#sec-3">3 A truth table program</a></li>
<li><a href="#sec-4">4 Fourth order recursion</a></li>
<li><a href="#sec-5">5 Exercises and reading</a>
<ul>
<li><a href="#sec-5-1">5.1 <i>Truth Table for Prefix</i>:</a></li>
<li><a href="#sec-5-2">5.2 <i>Semantic Tableaux 1 &mdash; trunk befor branch</i>:</a></li>
<li><a href="#sec-5-3">5.3 <i>New operators for regular expressions and grammars</i>:</a></li>
<li><a href="#sec-5-4">5.4 <i>Semantic Tableaux 2 &mdash; no internal code</i>:</a></li>
<li><a href="#sec-5-5">5.5 <i>Parallelism</i>:</a></li>
<li><a href="#sec-5-6">5.6 <i>LOTOS</i>:</a></li>
<li><a href="#sec-5-7">5.7 <i>An ambitious project</i>:</a></li>
<li><a href="#sec-5-8">5.8 <i>Reading</i>:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
In this chapter we continue the study of higher order recursion, with emphasis on third and fourth order recursion.  The style of this chapter resembles that of Chapter 8 in that toy programs are used to illustrate techniques.  There are two programs which use third order recursion to do without internal code what normally is done with internal code.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Third order recursion</h2>
<div class="outline-text-2" id="text-2">


<p>
In the literature there are hardly any examples of procedures which take as parameters procedures which in turn take procedures as parameters.  I only know of one example, due to Steengaard-Masden (1981), in which he uses such a technique for information hiding.  The program below is adapted from his paper (p 1334); its sole output is the sequence of numbers <code>33 22 11=1 from procedure =demo</code>.  The point of using the method at all is to hide the variables <code>s</code> and <code>ptr</code>, the stack and its top of stack pointer, in procedure <code>stack-implementation</code>, so that they cannot be inadvertently corrupted by <code>main</code> or by <code>demo</code>.  Observe that procedure <code>dem=o uses readable names for the stack operations =new</code>, <code>empty</code>, <code>push</code>, <code>pop</code> and <code>top</code>.  Observe also that the corresponding local procedures inside the stack implementation procedure have cryptic names, and that the parameter procedures to the formal parameter of the stack implementation procedure are even more cryptic.  This is intentional &mdash; the user of the stack implementation procedure need not know the names of its parameters or its local variables and procedures.
</p>



<pre class="example">PROGRAM stackmodule(output);

PROCEDURE stack_implementation
        (PROCEDURE cp
                  (PROCEDURE n;
                   FUNCTION e : boolean;
                   PROCEDURE p1(n : integer);
                   PROCEDURE p2;
                   FUNCTION t : integer));

VAR s : ARRAY[0..20] OF integer; ptr : integer;

    PROCEDURE nw; BEGIN ptr := 0 END;
    FUNCTION em : boolean; BEGIN em := ptr = 0 END;
    PROCEDURE psh(n : integer); BEGIN ptr := ptr + 1; s[ptr] := n END;
    PROCEDURE pp; BEGIN ptr := ptr - 1 END;
    FUNCTION tp : integer; BEGIN tp := s[ptr] END;

BEGIN (* stack_implementation *)
cp(nw,em,psh,pp,tp)
END; (* stack_implementation *)

PROCEDURE demo(PROCEDURE new;
               FUNCTION empty : boolean;
               PROCEDURE push(n : integer);
               PROCEDURE pop;
               FUNCTION top : integer);

BEGIN (* demo *)
new; push(11); push(22); push(33);
WHILE NOT empty DO
    BEGIN write(top); pop END
END; (* demo *)

BEGIN (* main *)
stack_implementation(demo)
END. (* main *)
</pre>


<p>
But note that there is no recursion in this program;
in what follows we shall only be concerned with
third order procedures which are recursive
in an interesting way.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> An example of third order recursion</h3>
<div class="outline-text-3" id="text-2-1">


<p>
The following program again reads lines of what will be digit characters.  For each line that it has read it will write on one line six lots of characters: the digits forward, their uppercase letter counterpart backward, the lowercase letter counterpart forward, the lowercase letter counterpart backward, the uppercase letter counterpart forward, the digits backward.  Between any two lots of characters there is a separating space.  Note again that as for several programs in Chapter 8 there is no explicit array and there are no linked structures to save the input line.  Every character of the input line is saved in the single local variable <code>ch</code> on the run time stack.  Since there are six lots of printing characters, there are five occurrences of the separating space.  In the program, these five occurrences have been commented with <code>(* 1 *)</code> = .. = <code>(* 5 *)</code>.  The forward and backward sequencing of characters is also commented.
</p>



<pre class="example">PROGRAM third_order_recursion(input,output);

PROCEDURE spacing;
BEGIN write('    ') END;

PROCEDURE spacedcall(PROCEDURE c);
BEGIN
spacing;                (* 2 *)
c;
spacing                 (* 4 *)
END; (* spacedcall *)

PROCEDURE recurse(PROCEDURE cp(PROCEDURE c); PROCEDURE ccp);
VAR ch : char;

    PROCEDURE local(PROCEDURE c);

        PROCEDURE locallocal;
        BEGIN                                    (* lower case *)
        write(chr(ord(ch) + ord('a') - ord('0'))); (* forward  *)
        c;      (* when c = spacing, 3 *)
        write(chr(ord(ch) + ord('a') - ord('0')))  (* backward *)
        END; (* locallocal *)

    BEGIN (* local *)                        (* upper case *)
    write(chr(ord(ch) + ord('A') - ord('0'))); (* backward *)
    cp(locallocal);
    write(chr(ord(ch) + ord('A') - ord('0')))  (* forward  *)
    END; (* local *)

BEGIN (* recurse *)
IF eoln THEN
    BEGIN
    ccp;                        (* 1 *)
    cp(ccp);
    ccp                         (* 5 *)
    END
  ELSE
    BEGIN                       (* digit    *)
    read(ch);
    write(ch);                  (* forward  *)
    recurse(local,ccp);
    write(ch)                   (* backward *)
    END
END; (* recurse *)

BEGIN (* main *)
WHILE NOT eof DO
    BEGIN recurse(spacedcall,spacing); writeln; readln END
END. (* main *)
</pre>


<p>
Again note that there is only one variable, local to procedure <code>recurse</code>.  It is accessed directly in procedure <code>recurse</code> for reading and writing the digits, it is accessed indirectly by one step through the static chain or its equivalent in procedure <code>local</code> for writing the upper case letters, and it is accessed indirectly by two steps through the static chain or its equivalent in procedure <code>locallocal</code> for writing the lower case letters.  The program is only useful as a skeleton for studying access into the recursion stack.
</p>
</div>

</div>
