text/12-higher-order-recursion.org
** Partitioning numbers again
<P>
The previous program structure lends itself to writing a program
which again will read lines of numbers and
write them out on one line, partitioned into three lots:
those which after division by 3 leave a remainder of 0, 1 or 2.
Within each lot the original order is preserved.
#+begin_src pascal
PROGRAM partition3(input,output);

PROCEDURE writespace;
BEGIN write('    ') END;

PROCEDURE writespace_call(PROCEDURE c);
BEGIN writespace; c END;

PROCEDURE rem0(PROCEDURE cp(PROCEDURE c); PROCEDURE ccp);
VAR n : integer;

    PROCEDURE rem1(PROCEDURE c);

        PROCEDURE rem2;
        BEGIN write(n:0,' '); c END;

    BEGIN (* rem1 *)
    IF n MOD 3 = 1 THEN cp(rem2) ELSE
        BEGIN cp(c); write(n:0,' ') END
    END; (* rem1 *)

BEGIN (* rem0 *)
IF eoln THEN cp(ccp) ELSE
    BEGIN
    read(n);
    IF n MOD 3 = 0
        THEN BEGIN write(n:0,' '); rem0(cp,ccp) END
        ELSE rem0(rem1,ccp)
    END
END; (* rem0 *)

BEGIN (* main *)
WHILE NOT eof DO
    BEGIN rem0(writespace_call,writespace); writeln; readln END
END. (* main *)
#+end_src
<P>
** Infix to prefix translation
<P>
Translations between prefix, infix and postfix notations
for arithmetical, logical or any other expressions
fall into two groups:
1) those in which operators have to be shifted to the right,
as in prefix to infix, prefix to postfix, and infix to postfix,
and 2) those in which operators have to be shifted to the left,
as in postfix to infix, infix to prefix, and postfix to prefix.
Translations of the first kind can be done on the fly
by a recursive descent translator, no intermediate
representation is necessary.
By contrast, for translations of the second kind
the normal practice would be to produce an internal intermediate
code representation, and then to translate that into the desired form.
For example, binary trees are an excellent intermediate form.
But there is a way of doing it which avoids any explicit
intermediate representation.
<P>
The program to be written next
repeatedly reads formulas of propositional
logic in infix notation and translates them into prefix notation;
the two notations are in accordance
with the translation grammar:
#+begin_src pascal
INFIX                                   PREFIX
formula ::=                             formula ::=
    'a' .. 'z'                              'a' .. 'z'
  | '-' formula                           | 'N' formula
  | '(' formula1 '&' formula2 ')'         | 'K' formula1 formula2
  | '(' formula1 'v' formula2 ')'         | 'A' formula1 formula2
  | '(' formula1 '>' formula2 ')'         | 'C' formula1 formula2
  | '(' formula1 '=' formula2 ')'         | 'E' formula1 formula2
#+end_src
The conventional way would be to write a recursive descent
parser for the infix grammar, augmented to produce a binary
tree as an internal representation,
and upon completing the parsing to do a pre-order traversal
of the tree to generate the prefix translation.
The program to be written avoids the need for
an explicit internal representation.
Instead it uses continuations to continuations
to produce the prefix.
<P>
In order to model a parser on a grammar,
it is necessary to design a grammar that is suitable
for a particular parsing technique.
For recursive descent one would use the first grammar,
for what might be called /recursive continuation parsing/
we shall use the second grammar.
As the first grammar shows,
the language can be specified using just one non-terminal,
but the second grammar uses three:
=formula=, =rest= and =right-parenthesis=.
Obviously both grammars can be used for recursive descent,
but for recursive continuation parsing something like the second grammar is mandatory.
#+begin_src pascal
GRAMMAR-1                           GRAMMAR-2
formula ::=                         formula ::=
    'a' .. 'z'                          'a' .. 'z'
  | '-' formula                       | '-' formula
  | '(' formula                       | '(' formula rest.
    ('&' | 'v' | '>' | '=')         rest ::=
    formula ')'.                        ('&' | 'v' | '>' | '=')
                                        formula
                                        right_parenthesis.
                                    right-parenthesis ::=
                                        ')'.
#+end_src
Note that in =GRAMMAR-2=
the right hand sides of the productions contain several instances
of two adjacent non-terminals.
In a recursive continuation parser the first of them becomes
a call to a parsing procedure,
and the second one is passed on as a continuation parameter.
As with recursive descent,
when the writing of the parser is completed,
then appropriate further procedures are added for
the translation.
The resulting program is this:
#+begin_src pascal
PROGRAM infix_to_prefix(input,output);

LABEL 1, 99;

TYPE
    message = PACKED ARRAY [1..30] OF char;

PROCEDURE starttranslating(PROCEDURE emit_whole_formula);
BEGIN write('Prefix : '); emit_whole_formula END;

PROCEDURE infix(PROCEDURE cp(PROCEDURE c));
VAR ch : char;

    PROCEDURE getch;
    BEGIN (* getch *)
    REPEAT
        IF eof THEN GOTO 99;
        read(ch)
        UNTIL ch > ' '
    END; (* getch *)

    PROCEDURE error(mes : message);
    BEGIN (* error *)
    writeln('  ERROR : seen "',ch,'" when ',mes);
    readln;
    GOTO 1
    END; (* error *)

    PROCEDURE emit_atomic_formula;
    BEGIN write(ch) END;

    PROCEDURE savenegation(PROCEDURE emit_negand);

        PROCEDURE emit_negated_formula;
        BEGIN write('N'); emit_negand END;

    BEGIN cp(emit_negated_formula) END; (* savenegation *)

    PROCEDURE save_first(PROCEDURE emit_first);
    VAR op : char;

        PROCEDURE check_right_parenthesis(PROCEDURE emit_second);

            PROCEDURE emit_binary_formula;
            BEGIN write(op); emit_first; emit_second END;

        BEGIN (* check_right_parenthesis *)
        getch;
        IF ch &lt;> ')' THEN
            error('")" expected                  ');
        cp(emit_binary_formula)
        END; (* check_right_parenthesis *)

    BEGIN (* save_first *)
    getch;
    IF NOT (ch IN ['&','v','>','=']) THEN
        error('"&","v",">" or "=" expected   ');
    CASE ch OF
        '&' : op := 'K';
        'v' : op := 'A';
        '>' : op := 'C';
        '=' : op := 'E'
        END; (* CASE *)
    infix(check_right_parenthesis)
    END; (* save_first *)

BEGIN (* infix *)
getch;
CASE ch OF
    'a'..'z' : cp(emit_atomic_formula);
    '-'      : infix(savenegation);
    '('      : infix(save_first);
    OTHERWISE  error('start of formula expected     ');
    END (* CASE *)
END; (* infix *)

BEGIN (* main *)
1: REPEAT
    write('Infix  : ');
    infix(starttranslating);
    writeln
    UNTIL false;
99:
END.
#+end_src
<P>
Note again that this program manages translation from
infix to prefix without any explicit intermediate representation.
