text/12-higher-order-recursion.org
* A truth table program

This section contains the design of a still quite short program which also uses third order recursion.  It differs from the previous one in that the grammar of the input language is more complex, and in that the continuation procedures which take the place of an internal code representation are actually called many times.  The program will repeatedly 1) read formulas in propositional logic written in minimally parenthesised infix notation with conventional operator precedences, and 2) for each formula read the program will produce a truth table, consisting of a header line containing the atoms and for each combination of truth values of the atoms a line of the truth values of the atoms and one value for the main formula.  The values of subformulas are not written out; this could be done with conventional techniques and perhaps it could also be done with further continuation passing techniques --- but these are not explored here.

The conventional way of writing a truth table program would be to write a recursive descent parser, augmented to generate an internal representation.  That internal representation would be traversed repeatedly, once for each line of the truth table.  The most likely choice for an internal representation would be postfix code because it is the most efficient to evaluate, but tree code is another possible choice.  But do note that whatever the internal code, it has to be interpreted for each of the operators.  The program to be designed now avoids the need for an internal representation and avoids the need for the decoding of that code.

The design of the program follows the structure of specification given earlier: 1) recursive procedures are to be written for reading formulas and detecting any errors, and 2) the procedures are to be augmented to produce the truth table.  In a normal recursive descent parser, the procedures for reading formulas would have the same structure as the non-terminals of the input grammar.  The same is true for a recursive continuation parser, though the input grammar has to be rewritten somewhat.  The two grammars below give the details; the grammar on the left is most suitable for recursive descent, the grammar on the right is suitable for recursive continuation parsing.

#+begin_src pascal
GRAMMAR-1                               GRAMMAR-2

 input  ::=                              input  ::=
    formula '.'                             formula period
                                        period  ::=
                                            '.'
formula  ::=                            formula  ::=
    expression [ ('=' | '>') formula ]      expression formula2
                                        formula2  ::=
                                            { ('=' | '>') formula2 }
expression  ::=                         expression  ::=
    term [ 'v' term ]                       term expression2
                                        expression2  ::=
                                            { 'v' expression }
term ::=                                term  ::=
    factor [ '&' factor ]                   factor term2
                                        term2  ::=
                                            { '&' term }
factor  ::=                             factor  ::=
    'a' .. 'z'                              'a' .. 'z'
  | '-' factor                            | '-' factor
  | '(' formula ')'                       | '(' formula rparen
                                        rparen  ::=
                                            ')'
#+end_src


In recursive descent parsers and translators it is essential that each parsing procedure can /see/ any other parsing procedures that it needs to call.  There are two ways of achieving this: 1) by making all parsing procedures global, and giving forward declarations where necessary, or 2) by nesting.  Nesting is often preferred as a matter of style, but for recursive continuation parsing it becomes a necessity.  The visibility requirements are satisfied by the following block structure:

#+begin_src pascal
PROCEDURE check_period
PROCEDURE parse_formula
    PROCEDURE parse_expression
        PROCEDURE parse_term
            PROCEDURE parse_factor
                PROCEDURE check_right_parenthesis
            PROCEDURE parse_term2
        PROCEDURE parse_expression2
    PROCEDURE parse_formula2
#+end_src

The procedures for parsing formulas, expressions, terms and factors correspond to the non-terminals of the original grammar, and they all take a continuation procedure as a parameter.  The procedures for parsing the second parts of formulas, expressions and terms, and those for checking right parentheses and final period, are local and are passed on as continuations.  Note that the error procedure does not contain an escape =GOTO=, this is possible because all calls to it also prevent the execution of outstanding continuations, and hence any outstanding returns can perform normally --- it just so happens that there is never anything to do upon return.

The program is as follows:

#+begin_src pascal
PROGRAM truthtable_with_cont(input,output);

LABEL 99;

TYPE
    message = PACKED ARRAY[1..20] OF char;

VAR
    ch : char;
    occurrences, truevars : SET OF 'a'..'z';

PROCEDURE getch;
BEGIN
REPEAT
    IF eof THEN GOTO 99;
    read(ch)
    UNTIL ch > ' '
END; (* getch *)

PROCEDURE error(mes : message);
BEGIN
writeln('ERROR: seen "',ch,'" when ',mes);
readln
END; (* error *)

PROCEDURE check_period
    (FUNCTION main_formula : boolean);

    PROCEDURE table(c : char);
    VAR c0 : char;
    BEGIN (* table *)
    WHILE NOT (c IN occurrences) DO c := succ(c);
    IF c > 'z' THEN
        BEGIN
        FOR c0 := 'a' TO 'z' DO
            IF c0 IN occurrences THEN
                write(ord(c0 IN truevars):1,' ');
        writeln('    ',ord(main_formula):1)
        END
      ELSE
        BEGIN
        truevars := truevars + [c]; table(succ(c));
        truevars := truevars - [c]; table(succ(c))
        END
    END; (* table *)

VAR c : char;
BEGIN
IF ch &lt;> '.' THEN error('"." expected        ');
FOR c := 'a' TO 'z' DO
    IF c IN occurrences THEN write(c,' ');
writeln;
truevars := [];
table('a')
END; (* check_period *)

PROCEDURE parse_formula
    (PROCEDURE cp(FUNCTION val : boolean));

    PROCEDURE parse_expression
        (PROCEDURE cp(FUNCTION val : boolean));

        PROCEDURE parse_term
            (PROCEDURE cp(FUNCTION val : boolean));

            PROCEDURE parse_factor
                (PROCEDURE cp(FUNCTION val : boolean));
            VAR at : char;

                PROCEDURE check_right_parenthesis
                    (FUNCTION val : boolean);
                BEGIN (* check_right_parenthesis *)
                IF ch &lt;> ')' THEN error('")" expected        ') ELSE
                    BEGIN getch; cp(val) END
                END; (* check_right_parenthesis *)

                FUNCTION val_atom : boolean;
                BEGIN val_atom := at IN truevars END;

                PROCEDURE save_negation
                    (FUNCTION val : boolean);

                    FUNCTION val_negation : boolean;
                    BEGIN val_negation := NOT val END;

                BEGIN (* save_negation *)
                cp(val_negation)
                END; (* save_negation *)

            BEGIN (* parse_factor *)
            CASE ch OF
                'a'..'z' :
                    BEGIN
                    at := ch; occurrences := occurrences + [ch];
                    getch; cp(val_atom)
                    END;
                '-' :
                    BEGIN getch; parse_factor(save_negation) END;
                '(' :
                    BEGIN
                    getch;
                    parse_formula(check_right_parenthesis)
                    END;
                OTHERWISE
                    error('factor expected     ')
                END (* CASE *)
            END; (* parse_factor *)

            PROCEDURE parse_term2
                (FUNCTION val_left : boolean);

                PROCEDURE save_conj
                    (FUNCTION val_right : boolean);

                    FUNCTION val_conj : boolean;
                    BEGIN val_conj := val_left AND val_right END;

                BEGIN (* save_conj *)
                cp(val_conj)
                END; (* save_conj *)

            BEGIN (* parse_term2 *)
            IF ch = '&' THEN
                BEGIN getch; parse_term(save_conj) END
            ELSE cp(val_left)
            END; (* parse_term2 *)

        BEGIN (* parse_term *)
        parse_factor(parse_term2)
        END; (* parse_term *)

        PROCEDURE parse_expression2
            (FUNCTION val_left : boolean);

            PROCEDURE save_disj
                (FUNCTION val_right : boolean);

                FUNCTION val_disj : boolean;
                BEGIN val_disj := val_left OR val_right END;

            BEGIN (* save_disj *)
            cp(val_disj)
            END; (* save_disj *)

        BEGIN (* parse_expression2 *)
        IF ch IN ['v','#'] THEN
            BEGIN getch; parse_expression(save_disj) END
        ELSE cp(val_left)
        END; (* parse_expression2 *)

    BEGIN (* parse_expression *)
    parse_term(parse_expression2)
    END; (* parse_expression *)

    PROCEDURE parse_formula2
        (FUNCTION val_left : boolean);

        PROCEDURE save_conditional
            (FUNCTION val_right : boolean);

            FUNCTION val_conditional : boolean;
            BEGIN val_conditional := val_left &lt;= val_right END;

        BEGIN (* save_conditional *)
        cp(val_conditional)
        END; (* save_conditional *)

        PROCEDURE save_equivalence
            (FUNCTION val_right : boolean);

            FUNCTION val_equivalence : boolean;
            BEGIN val_equivalence := val_left = val_right END;

        BEGIN (* save_equivalence *)
        cp(val_equivalence)
        END; (* save_equicvalence *)

    BEGIN (* parse_formula2 *)
    IF ch = '>' THEN
        BEGIN getch; parse_formula(save_conditional) END
    ELSE IF ch = '=' THEN
        BEGIN getch; parse_formula(save_equivalence) END
    ELSE cp(val_left)
    END; (* parse_formula2 *)

BEGIN (* parse_formula *)
parse_expression(parse_formula2)
END; (* parse_formula *)

BEGIN (* main *)
REPEAT
    write('?-  '); occurrences := [succ('z')];  getch;
    parse_formula(check_period)
    UNTIL false;
99:
writeln(clock:0,' milliseconds')
END. (* main *)
#+end_src

The loops inside the =table= procedure can be optimised, by creating a linked list of the variables that actually occur in the formula.  The program is about as long as an equivalent conventional recursive descent program with explicit internal code for the same input grammar.  Both would only be about half as long if the input grammar were for infix without precedences, or for prefix.

