text/12-higher-order-recursion.org
* Fourth order recursion

The following program repeatedly reads lines of characters, and for each line of n characters it writes (2^n)-1$ lines, each a non-empty subsequence of the line that has been read.  For example, for the input line =abc= it produces 7 output lines: =abc=, =bc=, =ac=, =c=, =ab=, =b= and =a=.

#+begin_src pascal
PROGRAM subsequences(input,output);

PROCEDURE call_with_continuation(PROCEDURE cp(PROCEDURE ccp);
                                 PROCEDURE ccp);
BEGIN cp(ccp) END;

PROCEDURE oneline(PROCEDURE cp(PROCEDURE ccp(PROCEDURE cccp);
                               PROCEDURE cccp));
VAR ch : char;

    PROCEDURE skip;
    BEGIN END;

    PROCEDURE call(PROCEDURE cp);
    BEGIN cp END;

    PROCEDURE onechar(PROCEDURE ccp(PROCEDURE cccp);
                      PROCEDURE cccp);

        PROCEDURE writechar(PROCEDURE cccp);
        BEGIN write(ch); ccp(cccp) END;

        PROCEDURE endline;
        BEGIN writeln; cp(ccp,cccp) END;

    BEGIN (* onechar *)
    cp(writechar,endline)
    END; (* onechar *)

BEGIN (* oneline *)
IF eoln THEN cp(call,skip) ELSE
    BEGIN read(ch); oneline(onechar) END
END; (* oneline *)

BEGIN (* main *)
WHILE NOT eof DO
    BEGIN oneline(call_with_continuation); readln END
END. (* main *)
#+end_src

* Exercises and reading

** /Truth Table for Prefix/:

One reason why the truth table program given above is so long is that it allows infix notation with many different precedence levels.  If the parser could be made much simpler, the value computing functions could be combined into one in a rather compact way.  Rewrite the program so that it uses prefix notation.

** /Semantic Tableaux 1 --- trunk before branch/:

Third order recursion can be used to implement the /trunk before branch/ optimisation in semantic tableaux recommended by the textbooks.  Rewrite the tableaux generator in any one of the programs you have so that operations that lead to branching are delayed.

** /New operators for regular expressions and grammars/:

One exercise in Chapter 11 invited you to write a program that reads context free grammars and then writes strings in the language generated by that grammar.  The most straightforward way is with second order recursion using the method of continuation procedures as in Chapters 9 and 11.  If you have done that, then you should consider investigating the power of third order recursion in connection with regular expressions and grammars.  You may be able to find at least two new unary operators and at least two new binary operators.  The four operators are independent, and each one increases the power of regular expressions and of context free grammars.  The program is useful for conducting experiments.

** /Semantic Tableaux 2 --- no internal code/:

This exercise contains the design of a non-trivial program which uses fourth order recursion.  The program is to repeatedly 1) read formulas in propositional logic written in minimally parenthesised infix notation with conventional operator precedences, and 2) for each formula read the program is to use the semantic tableaux method to determine whether the formula is a tautology, and if the formula is not a tautology the program is to write the /open paths/, the sets of atoms that have to be made true or false to make the formula false.  The program should use the same input grammar as the truth table program in the previous section.  The object of the exercise is to write the program without any explicit internal code.

The design should be similar to the design of the truth table program: 1) write recursive procedures with continuations to do the parsing, and 2) add procedures to do the semantic tableaux.  The design of the program follows the structure of specification given: 1) recursive procedures are to be written for reading formulas and detecting any errors, and 2) the procedures are to be augmented to execute the semantic tableaux method.

** /Parallelism/:

If =L1= and =L2= are two context free languages, then their union =L ::\equal L1 | L2= is also a context free language.  However, their intersection need not be.  For example, the following language =L3= is not context free: =L3= has as its members, for each positive integer $n$, the strings consisting of a number $n$ of =a=\s, followed by that same number $n$ of =b=\s, followed by that same number $n$ of =c=\s, thus --- =abc=, =aabbcc=, =aaabbbccc= and so on.  The recursion stack of a context free parser can ensure that the number of =a=\s is the same as the number of =b=\s, or it can ensure that the number of =b=\s is the same as the number of =c=\s, but it cannot ensure both.  However, that language is the intersection of two context free languages =L1= and =L2=, where =L1= has as members all strings consisting of an arbitrary number of =a=\s followed by some number $n$ of =b=\s, followed by that same number $n$ of =c=\s, and where =L2= has as members all strings consisting of some number $n$ of =a=\s, followed by that same number $n$ of =b=\s, followed by an arbitrary number of =c=\s. So a parallel combination of parsers of =L1= and =L2= could be used to determine membership of =L3=.  A binary intersection or parallelism operator can clearly be added to the repertoire of grammars or of regular expressions, it strictly increases the power of the former though not of the latter.

Implement such a new operator in either a generator or a parser, either for grammars or for regular expressions.  A promising way to implement parallelism is by turning the continuation procedure of the interpreter into one which itself takes a continuation.  The interpreter itself will take a further continuation as a parameter.  Inside the interpreter, for the atomic case, instead of reading or generating the next character (or symbol), the first continuation is called with the second continuation as a parameter.  For the initial global call of the interpreter, the first actual continuation parameter would be a global procedure which merely calls its continuation, and the second actual continuation parameter would be a global procedure which reads or generates the next character (or symbol).  This will be an example of third order recursion.

