text/12-higher-order-recursion.org
** /LOTOS/:

A sophisticated generalisation of the parallelism operator occurs in LOTOS --- Language Of Temporal Ordering Specifications.  The strings of a language are sequences of symbols, so if the symbols denote occurrences of events or actions, a whole string denotes a sequence of actions or a particular evolution of a process.  A very readable exposition of the basic notions is given in Bolognesi and Brinksma (1987, sections 1 and 2).  What in formal language theory is called concatenation is here called sequential composition and is written with an infix symbol, double arrow =>>=.  What in formal language theory is called alternation and written as an infix bar =|= is here called the choice operator, written =[]=.  In addition there are parallelism operators, written =|[a b c ..]|= as binary infix operators.  An expression =P |[a b c ..]| Q= denotes a process composed of processes =P= and =Q= restrained to perform actions in the set =[a b c ..]= synchronously, but not required to perform any other actions synchronously.  Note that the parallelism operator really is ternary, it takes three operands: the two sequences written on the left and the right, and the set of synchronisation actions written inside the operator.  In one special case the set of synchronised actions is empty, this is called pure interleaving, and instead of =|[]|= one writes =|||=.  In the other special case the set of synchronised actions contains all (visible) actions of =P= and of =Q=, for brevity the symbol =||= is used.  This is essentially the intersection operator of the previous paragraph.

As a project, implement some very rudimentary form of these operators.  For parallelism operators, the nodes of the tree will have to contain a left and right field as before, and in addition a set field.  The set contains all the actions on which the two operands have to synchronise.  If you also want to implement the hiding operator, a similar representation should prove useful.  In full LOTOS process definitions have explicit parameters, called gates, at which events or actions are considered to take place.  An implementation of parameters would no longer be rudimentary.  Full LOTOS is a large language, and any implementation of a simulator for more than a small subset is well outside the scope of the projects in this book.

** /An ambitious project/:

If you are fluent in Lisp and are at least aware of the problems of implementing Lisp, you might attempt to implement a small version using the techniques of this chapter to handle /all/ data structures with local variables accessed by procedures as parameters.  A good starting point is probably Henderson's (1980) Lispkit.

** /Reading/:

If you are wondering how procedures as parameters are implemented, see MacLennan (1983, pp 247 - 250).
