12-higher-order-recursion.html

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <i>LOTOS</i>:</h3>
<div class="outline-text-3" id="text-5-6">

<p>A sophisticated generalisation of the parallelism operator occurs in LOTOS &mdash; Language Of Temporal Ordering Specifications.  The strings of a language are sequences of symbols, so if the symbols denote occurrences of events or actions, a whole string denotes a sequence of actions or a particular evolution of a process.  A very readable exposition of the basic notions is given in Bolognesi and Brinksma (1987, sections 1 and 2).  What in formal language theory is called concatenation is here called sequential composition and is written with an infix symbol, double arrow <code>&gt;&gt;</code>.  What in formal language theory is called alternation and written as an infix bar <code>|</code> is here called the choice operator, written <code>[]</code>.  In addition there are parallelism operators, written <code>|[a b c ..]|</code> as binary infix operators.  An expression <code>P |[a b c ..]| Q</code> denotes a process composed of processes <code>P</code> and <code>Q</code> restrained to perform actions in the set <code>[a b c ..]</code> synchronously, but not required to perform any other actions synchronously.  Note that the parallelism operator really is ternary, it takes three operands: the two sequences written on the left and the right, and the set of synchronisation actions written inside the operator.  In one special case the set of synchronised actions is empty, this is called pure interleaving, and instead of <code>|[]|</code> one writes <code>|||</code>.  In the other special case the set of synchronised actions contains all (visible) actions of <code>P</code> and of <code>Q</code>, for brevity the symbol <code>||</code> is used.  This is essentially the intersection operator of the previous paragraph.
</p>
<p>
As a project, implement some very rudimentary form of these operators.  For parallelism operators, the nodes of the tree will have to contain a left and right field as before, and in addition a set field.  The set contains all the actions on which the two operands have to synchronise.  If you also want to implement the hiding operator, a similar representation should prove useful.  In full LOTOS process definitions have explicit parameters, called gates, at which events or actions are considered to take place.  An implementation of parameters would no longer be rudimentary.  Full LOTOS is a large language, and any implementation of a simulator for more than a small subset is well outside the scope of the projects in this book.
</p>
</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> <i>An ambitious project</i>:</h3>
<div class="outline-text-3" id="text-5-7">

<p>If you are fluent in Lisp and are at least aware of the problems of implementing Lisp, you might attempt to implement a small version using the techniques of this chapter to handle <i>all</i> data structures with local variables accessed by procedures as parameters.  A good starting point is probably Henderson's (1980) Lispkit.
</p>
</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-8">

<p>If you are wondering how procedures as parameters are implemented, see MacLennan (1983, pp 247 - 250).
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:38:00 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
